{"Please enter the email address where the TPA Summary should be sent:": "", "If you would like, enter an email address for a second recipient:": "", "If you would like, enter an email address for a third recipient:": "", "Plan Sponsor EIN:": "", "Plan Legal Name:": "", "IRS Plan Number:": "", "Plan Year End:": "", "Is this a Union plan?:": "Y/N", "Is this a multiple employer Plan?:": "", "Original Plan effective Date:": "", "Company Establishment Date": "", "Will the plan allow Before Tax Contributions?:": "", "How does the plan track deferrals?:": "Dollars\nDollars and Percents\nPercents", "Minimum deferral percentage:": "", "Maximum deferral percentage:": "", "Minimum deferral amount:": "", "Maximum deferral amount (if other than 402g limit):": "", "Will the plan allow 50+ Catch-Up Contributions?:": "", "Does your plan allow for fractional percentage elections? If yes, select appropriate value from drop down:": "Whole\nHalf\nQuarter\nTenths\nHundredths", "Is there a separate Before Tax Maximum % for HCE Employees?:": "", "Does your plan allow for fractional amount elections? If yes, select appropriate value from drop down:": "Whole\nHalf\nQuarter\nTenths\nHundredths", "Is there a separate Before Tax Maximum amount for HCE Employees?:": "", "Are 50+ Catch-Up Contributions tracked as a Separate Election? (\"No\" is standard value):": "", "How does the plan track catch-up deferrals?:": "Dollars\nDollars and Percents\nPercents", "If there is a separate catch-up Maximum % for HCE Employees, provide %:": "", "If there is a separate catch-up Maximum amount for HCE Employees, provide amount:": "", "Will the plan allow After Tax Contributions?:": "", "Is there a minimum after-tax percentage allowed by the Plan?:": "Enter %", "Is there a maximum after-tax percentage allowed by the Plan?:": "Enter %", "Is there a minimum after-tax amount allowed by the Plan?:": "Enter the amount", "Is there a maximum after-tax amount allowed by the Plan? (if other than 402g limit):": "Enter the amount", "Will the plan allow Roth deferrals?:": "", "Does the Plan allow Roth Corrective distributions?:": "", "Confirm the money type order for corrective distributions:": "Before Tax then Roth\nRoth then Before Tax", "Does the Plan allow for Roth conversions of before tax monies?:": "Y/N", "Will the plan's existing in-service and separation from service distribution provisions apply?:": "Y/N", "Does the Plan allow In-Plan Roth Transfers?:": "Y/N", "Does the Plan utilize the automatic enrollment feature?:": "Y/N", "Will Empower administer automatic enrollment?:": "Y/N", "Is this an existing Automatic Enrollment feature?:": "Y/N", "What type of Automatic Enrollment Arrangement is the plan?:": "EACA\nACA\nQACA\nEQAC", "What is the beginning default auto enroll before tax %?:": "1-10%", "Will the plan increase the default deferral %?:": "Y/N", "What % will the automatic deferral increase annually?:": "", "What is the maximum automatic deferral %?:": "6-15%", "Does plan perform annual increase on Date of Participation?:": "", "What is the date of annual increase for all participants? If left blank, 01/01 will be used as the assumed increase date.:": "If 'N' is selected for Page 5010 Seq 30, enter date. If left blank 1/1 will be used.", "What is the Automatic Enrollment Default Increase Year?:": "", "Which Safe harbor election will apply?:": "Profit Sharing\nMatch", "Does a \"Wait and See\" or \"Maybe\" provision apply?:": "Y/N", "Which vesting schedule will apply?:": "1 Yr/50 (0=0, 1=50, 2=100)\nCliff2 (0=0, 1=0, 2=100)\nImmed (100% immediate vesting)\nOther", "Please describe your Vesting Schedule:": "If 'Other' is selected in page 6830 seq 60, enter vesting schedule here.", "Will forfeitures be used to pay Plan expenses?:": "Y/N", "Will forfeitures be used to reallocate?:": "Y/N", "Will forfeiture money be used to reduce the employers contributions?:": "Y/N", "Will forfeitures be used for QAC or all employer monies?:": "All\nQAC", "Will the plan allow the Permissible withdrawal election?:": "Y/N", "Number of days?:": "", "How will this provision be applied?:": "", "What date will the QAC provision be applied to eligible participants?:": "", "What is the beginning default auto enroll before tax % ?:": "", "Will the plan increase the default deferral % ?:": "", "What is the maximum automatic deferral %:": "", "What date will the ACA provision be applied to eligible participants?:": "", "Will the plan allow for incoming rollovers?:": "Y/N", "When are Rollovers into the Plan allowed?:": "As soon as employed\nUpon becoming eligible", "Are 401 rollovers allowed by the plan?:": "Y/N", "Are Roth rollovers allowed by the plan?:": "Y/N", "Are after-tax rollovers allowed by the plan?:": "Y/N", "Are 403(b) rollovers allowed by the plan?:": "Y/N", "Are 457(b) rollovers allowed by the plan?:": "Y/N", "Are Pension (Lump Sum) rollovers allowed by the plan?:": "Y/N", "Are Roth 403(b) rollovers allowed by the plan?:": "Y/N", "Are Roth 457(b) rollovers allowed by the plan?:": "Y/N", "Are SARSEP IRA rollovers allowed by the plan?:": "Y/N", "Are SEP-IRA rollovers allowed by the plan?:": "Y/N", "Are SIMPLE IRA rollovers allowed by the plan?:": "Y/N", "Are Traditional IRA rollovers allowed by the plan?:": "Y/N", "Will the plan allow Employer Match Contributions?:": "Y/N", "Will the plan match on catch-up contribution?:": "Y/N", "Will the match be employer directed?:": "Y/N", "<b>Contact your assigned Implementation Analyst for assistance PRIOR to proceeding with the questionnaire. Product Exception required for Employer Direction of Investment.</b>": "data entry person roll with a yes - no need to clarify", "Is Match Discretionary?:": "Y/N", "Does the plan want to include Match contribution language and formulas in Kits and Plan Highlights?:": "Y/N", "Vesting Schedule?:": "1 Yr/50 (0=0, 1=50, 2=100)\nCliff2 (0=0, 1=0, 2=100)\nImmed (100% immediate vesting)\nOther", "What are the Allocation Conditions?:": "None\nEmployed on last day of plan year\n1000 hours\n1000 hours and employed on last day of plan year\n501 hours and employed on last day of plan year\nOther", "Please describe your Allocation Conditions:": "If 'Other' is selected in page 6740 seq 62, enter Allocation Conditions here.", "Allocation is waived for termination as a result of:": "NA or Retirement\nNA or Disability\nNA or Death\nNA or Early Retirement", "Will forfeitures  be used for match only or all employer monies?:": "All\nMatch", "Will the plan allow Profit Sharing Contributions?:": "Y/N", "Will the Profit Sharing contributions be employer directed?:": "Y/N", "Is Profit Sharing Discretionary?:": "Y/N", "Does the plan want to include Profit Sharing contribution language and formulas in Kits and Plan Highlights?:": "Y/N", "<b style=\"color:red\">A \"Yes\"? answer to the question above will include profit sharing contribution language in Kits and Plan Highlights.</b>": "data entry person roll with a yes - no need to clarify", "Vesting schedule?:": "Immediate", "Will forfeitures be used to pay plan expenses?:": "Y/N", "Will forfeitures money be used to reduce the employers contributions?:": "Y/N", "Will forfeitures be used for profit sharing only or all employer contributions?:": "\"", "Will the plan allow Safe Harbor Contributions?:": "Y/N", "What type of Safe Harbor Contribution?:": "Match\nNon-Elective", "Will the Safe Harbor contributions be employer directed?:": "Y/N", "What is the vesting computation method?:": "\"?", "What are the minimum service hours required to be credited with a year of vesting?": "", "Does the Plan allow for full vesting once a participant meets any of the following conditions?": "", "Will the plan have exclusions for the purposes of vesting?:": "Y/N", "What service is excluded for purposes of vesting?": "Prior to age 18\nPrior to effective date of the plan", "In lieu of supplying hours to us for vesting purposes only, do you want to supply years of service or percentages to us for an upload onto the recordkeeping system?:": "", "Does the plan allow for a Qualified Matching Contribution (QMAC)?:": "Y/N", "Does the plan allow for a Qualified Non-Elective Contribution (QNEC)?:": "Y/N", "Additional Active Money Types?:": "Y/N - If no, skip the rest of the 6700 pages", "Is the additional Active Money Type an Employer Money Type?:": "Y/N", "Money type:": "Enter any money types that were enter previously that pertain to loans", "Money type description:": "", "Does the Plan intend to fund the discretionary profit sharing contribution on an ongoing basis?:": "Y/N", "Will the participants be restricted from directing how this money type is invested?:": "Y/N", "Please describe your Vesting Schedule (Money Types):": "If 'Other' is selected in page 6710 seq 60, enter vesting schedule here.", "What are the Allocation Conditions (Money Types):": "None\nEmployed on last day of plan year\n1000 hours\n1000 hours and employed on last day of plan year\n501 hours and employed on last day of plan year\nOther", "Will forfeiture be used for this same contribution source or all employer monies?:": "Y/N", "Are there any more Additional Active Money Types?:": "Y/N; If 'N' is selected then skip the all remaining 6700 rows.", "Vesting Schedule (Money Type)?:": "1 Yr/50 (0=0, 1=50, 2=100)\nCliff2 (0=0, 1=0, 2=100)\nImmed (100% immediate vesting)\nOther", "Additional Frozen Money Types?:": "Y/N - If no, skip the rest of the 6800 pages", "Is the additional Frozen Money Type an Employer Money Type?:": "Y/N", "Are there any more Additional Frozen Money Types?:": "Y/N - If no, skip the rest of the 6800 pages", "What is the eligibility computation method?:": "Actual\nElapsed\nDaily\nMonthly\nWeekly\nSemi-monthly", "What are the minimum service hours required to become eligible to participate in the plan? <b style=\"color:red\">Select Elapsed Time eligibility computation method above if only using 1 Actual Hour.<b>": "", "What is the Plan's entry date for contributions?:": "Annual\nImmediate\nMonthly\nQuarterly\nSemi-Annual", "What is the Plan's Prospective entry date?:": "Pertains to the question above:\nIf Immediate = Immediate;\nAll others except immediate: Next following, Coinciding with or next following", "What is the Plan's Eligibility Computation Period?:": "Plan Year\nAnniversary date", "What is the minimum age condition for eligibility for contributions?:": "", "Does the Plan have a service condition for eligibility for contributions?:": "Day\nImmediate\nMonth\nYear", "What is the service requirement for eligibility?:": "If Day is selected, drop down box with 1-31, 60, 90\nIf Month is selected, drop down box with 1-12\nIf Year is selected, drop down box with 1-2", "Will the Plan waive the eligibility requirement on the Plan effective date?:": "Y/N", "Will the Plan waive the eligibility requirement on an Alternate effective date?:": "Y/N", "What service is waived for purpose of eligibility?:": "Age\nService\nService and Age", "What date will service be waived?:": "", "Do you have any Money Types with different eligibility rules?:": "Y/N", "Which money types does the eligibility questions below apply?": "Enter any money types that were enter previously that pertain to loans", "What is the Plan's entry date for Plan Selections made above?:": "Annual\nImmediate\nMonthly\nQuarterly\nSemi-Annual", "What is the minimum age condition for eligibility for Plan Selections made above?:": "", "Does the Plan have a service condition for eligibility for Plan Selections made above?:": "Day\nImmediate\nMonth\nYear", "Do you have any money types with different eligibility rules?:": "Y/N", "Which money types does this apply to?:": "", "What is the Plan's Prospective or Retroactive entry date?:": "", "How often are match contributions made?:": "Annually\nMonthly\nPay Period", "What percentage of deferral does employer match?:": "", "Up to what percentage of compensation?:": "", "Does match formula contain another tier?:": "Y/N", "What is percentage for employer contribution?:": "", "Up to what percentage of compensation? (Percentage is inclusive of percentage provided in prior tier) Example: 1st tier: 100% up to 3% compensation, 2nd tier: 50% up to 5% compensation": "", "Does plan impose a maximum limit outside of IRS plan limits on either the compensation used to calculate the contribution or limit the total match contribution?:": "Y/N", "Plan imposed limit?:": "", "What time period does limit apply?:": "Annually\nMonthly\nPay Period", "What is the compensation or match contribution Dollar limit?:": "", "Which money type will this employer contribution be deposited into?:": "", "Select the money type(s) that will be matched:": "", "Is the profit sharing allocation formula a pro rata (uniform %)? If no, notify your Conversion Specialist:": "Y/N; If N, enter formula", "How often is the Profit Sharing contribution made?:": "Annually\nMonthly\nPay Period", "Does plan impose a maximum limit outside of IRS plan limits on either the compensation used to calculate the contribution or limit the total profit sharing contribution?:": "Y/N", "What is the compensation or profit sharing contribution maximum?:": "", "How often are safe harbor match contributions made?:": "Annually\nMonthly\nPay Period", "Up to what percentage of compensation?": "", "Does plan impose a maximum limit outside of IRS plan limits on either the compensation used to calculate the contribution or limit the total safe harbor non-elective match contribution?:": "Y/N", "What is the compensation or safe harbor contribution maximum?:": "", "How often are safe harbor non-elective contributions made?": "Annually\nMonthly\nPay Period", "Up to what percentage of compensation (If wait and see election applies, enter the lowest percentage)?:": "", "Does plan impose a maximum limit on either the compensation used to calculate the contribution or limit the total safe harbor non-elective contribution amount?": "Y/N", "Has plan elected to have Empower generate safe harbor notices?:": "yes for all plans all the way across", "Has plan elected to have Empower mail initial safe harbor notices?:": "yes for all plans all the way across", "Has plan elected to have Empower mail annual safe harbor notices?:": "yes for all plans all the way across", "What is the Plan&#39s normal retirement age?:": "", "Does the Plan have a Normal Retirement years of service requirement?:": "0-10 are the options", "Does the plan impose a Years of Participation requirement in addition to meeting the Normal Retirement Age?:": "Y/N", "How many Years of Participation are required by the Plan?:": "1-5 are the options", "Does the Plan have an early retirement age?:": "Y/N", "What is the Plan&#39s early retirement age": "", "Does the plan have an early retirement years of service requirement?": "0-10 are the options", "Does the plan have a early retirement years of participation requirement?": "Y/N", "Does the plan allow for In-Service Distributions (to include prior Rollovers and/or After Tax Distributions at any time)?:": "Y/N", "Prior Rollovers and/or After Tax distributions at any time ?:": "Y/N", "Provide money types eligible for distribution at any time:": "", "59.5 Allowed?": "Y/N", "Eligible Money Types available for distribution at age 59.5:": "", "Is 100% Vesting required for Employer Monies?:": "Y/N", "Select sources subject to 100% vesting <br>(excluding any sources that have an Immediate Vesting schedule for distribution at age 59.5)": "", "Hardship Withdrawals?:": "Y/N", "Please provide the Hardship Method:": "Safe Harbor\nFacts and Circumstances", "Does the plan include earnings on amounts attributable to Elective Deferrals for Hardship withdrawals?:": "Y/N", "Eligible Money Types available for Hardship:": "", "Select sources subject to 100% vesting <br>(excluding any sources that have an Immediate Vesting schedule) for hardship": "", "Disability distributions allowed?:": "Y/N", "Eligible Money Types available for Disability:": "", "Provide Disability Money Types subject to Vesting": "", "Do plan provisions contain a HEART provision?:": "Y/N", "Does plan allow for Deemed Severance Distributions?:": "Y/N", "Does plan allow for Qualified Reservist Distributions?:": "Y/N", "In-service Withdrawals permitted at an age other than 59.5 including Normal or Early Retirement Age?:": "Y/N", "Normal Retirement Age?:": "Y/N", "Eligible Money Types available for Normal Retirement Age:": "", "In-Service Early Retirement Age?:": "", "Eligible Money Types available for Early Retirement Age:": "", "Are In-Service distributions available at an age other than 59.5?:": "Y/N", "At what Age?:": "", "And how many Months?:": "0\n3\n6\n9", "Eligible Money Types available for distribution at an age other than 59.5:": "", "Provide Money Types subject to Vesting:": "", "Are there any other In-service withdrawal options permitted?:": "Y/N", "Provide the details of other In-service withdrawal options:": "If Y in page 7199 seq 10 provide withdraw options\nIf N - skip", "Does the Plan allow for involuntary distributions of terminated participants with deminimus vested balances?:": "Y/N", "Does the Plan require spousal consent on distributions?:": "Y/N", "Does Spousal Consent/QJSA apply to the entire plan or only to specific money sources?:": "If yes on 7230/10 options are\nEntire Plan\nMoney Sources", "Indicate Money Sources subject to Spousal Consent/QJSA:": "If money sources is selected for 7230/20 - enter applicable money types", "Indicate Beneficiary Spousal Rule per the Plan Document?:": "If page number 7230/Seq 10 = Y, the following options are available:\nSpouse must be at least 50% beneficiary or consent is required\nSpouse must be at least 50% beneficiary - mandatory\nSpouse must be at least 100% beneficiary - mandatory\nSpouse must be at least 66 2/3% beneficiary or consent is required\nSpouse must be at least 75% beneficiary or consent is required\nSpouse must be at least 100% beneficiary or consent is required\n\nIf page number 7230/Seq 10 = N; the only option is: Spouse must be at least 100% beneficiary or consent is required", "Plan will allow lump sum withdrawals. Are post-severance partial withdrawals of any kind allowed in the plan (e.g. RMDs, Installments, Partial Distributions)?:": "Y/N", "Please provide the additional Post-Severance Distribution Methods:": "Installments for Required Minimum Distributions only\nInstallments for Required Minimum Distributions only (and acceleration/partial withdrawls for participant who starts an installment)\nPartials/Ad-Hoc only\nInstallments and Partials/Ad-Hoc\nInstallments only\nInstallments only (and acceleration/partial withdrawls for participants who starts and installment\nPartials for Required Minimum Distributions only\nPartial/Ad-Hoc and Installments only for Required Minimum Distribution", "Does the Plan allow for withdrawls in the case of Domestic Abuse": "Y/N", "Does the plan allow for Disaster Relief Distributions": "Y/N", "Does the plan allow participants to request a penalty tax exception for reason of terminal illness": "Y/N", "Do you apply the pre-SBJPA rules where termination dates are <b><u>not</u></b> required for RMD purposes?:": "Y/N", "Do you have any Frequency requirements for withdrawals?:": "Y/N", "Allowable number of disbursements?:": "", "What is the Frequency time period?:": "Month\nQuarter\nRolling Months\nYear", "How many Rolling Months?:": "If entered rolling months in 7350/30; enter applicable values", "Disbursement Reasons": "Age 59 1/2\nDisability\nIn service normal retirement age\nIn service withdrawl\nIn service disability\nMinimum required distribution\nQualified birth or adoption\nRetirement\nSeverance of employment\nSuspension halt financial hardship/unforeseeable emergency", "Do you have any Minimum Amount requirements for withdrawals?:": "Y/N", "What is the Minimum Amount?:": "100\n250\n500\n1000\n2500\n5000\n10000\n35000", "In-Plan Roth Rollover are allowed for accounts that are:": "Fully Vested\nPartially Vested", "Is there a Minimum Age Limitation?:": "Y/N", "Enter Minimum Age (must be at least 59┬╜--age 70┬╜ for 457 deferrals):": "If Y  in page 7380 seq 40 - enter age", "Is there a Minimum Participation Limitation?:": "Y/N", "Enter Minimum Years of Participation (must be at least 5 - applies to employer sources only):": "If Y in page 7380 seq 60 - enter minimum years of participation", "Is there a Minimum Years of Accumulation  Limitation?:": "Y/N", "Enter Minimum Years of Accumulation (must be at least 2- applies to employer sources only):": "If Y in page 7380 seq 80 - enter minimum years of accumulation", "Is there a Minimum Amount Limitation?:": "Y/N", "Enter Minimum Amount that may be rolled over:": "If Y  in page 7390 seq 40 - enter age", "Is there a Maximum number of In-Plan Rollovers per Plan Year?:": "Y/N", "Enter Maximum number of In-Plan Rollovers per Plan Year:": "If Y in page 7380 seq 120 - enter maximum number of in plan roth rollovers", "Do other limitations apply to In-Plan Roth Rollovers?": "Y/N", "Other - enter other limitations (this information will not be loaded to the record keeping system)": "If Y in page 7390 seq 75 - enter any other limitation", "Eligible Money Types available for In-Plan Roth Rollover:": "Enter any money types that were enter previously that pertain to In-Plan Roth Rollover", "In-Plan Roth Transfers are allowed for accounts that are:": "Fully Vested\nPartially Vested", "Is there a Maximum number of In-Plan Transfer per Plan Year?:": "Y/N", "Enter Maximum number of In-Plan Transfers per Plan Year:": "If Y  in page 7390 seq 60 - enter age", "Do other limitations apply to In-Plan Roth Transfers?": "Y/N", "Eligible Money Types available for In-Plan Roth Transfer:": "Enter any money types that were enter previously that pertain to In-Plan Roth Transfer", "Does the plan offer loans?:": "Y/N", "Will Empower administer those loans?:": "Y/N", "Minimum loan amount:": "", "Loan Rate:": "", "Maximum number of loans and Loan types allowed:": "1 Loan General\n1 Loan General or Residential\n2 Loans General\n2 Loans General or Residential", "Will the plan be converting loans?:": "Y/N", "Maximum duration for general purpose loans (in months)": "", "Maximum duration for residential loans (in months):": "", "Are refinances allowed?:": "Y/N", "Are hardship loans only?:": "Y/N", "Safe harbor or Facts & Circumstances?:": "Safe Harbor\nFacts and Circumstances", "What money types are available for loans?:": "Enter any money types that were enter previously that pertain to loans", "Does a statement narrative, required to satisfy the Pension Protection Act of 2006 (\"PPA\"), need to be added to participant statements?:": "Y/N", "Please select the Integrated Allocation of Employer Contributions narrative:": "Integrated Allocation of Employer Contributions-2 Tier (100%)\nIntegrated Allocation of Employer Contributions-2 Tier (90%)\nIntegrated Allocation of Employer Contributions-2 Tier (90.01%)\nIntegrated Allocation of Employer Contributions-2 Tier (80%)\nIntegrated Allocation of Employer Contributions-2 Tier (80.01%)\nIntegrated Allocation of Employer Contributions-4 Tier (100%)\nIntegrated Allocation of Employer Contributions-4 Tier (90%)\nIntegrated Allocation of Employer Contributions-4 Tier (90.01%)\nIntegrated Allocation of Employer Contributions-4 Tier (80%)\nIntegrated Allocation of Employer Contributions-4 Tier (80.01%)\nIntegrated Allocation of Employer Contributions-2 Tier, but 4 Tier applies in any plan year for which the plan is top-heavy (100%)\nIntegrated Allocation of Employer Contributions-2 Tier, but 4 Tier applies in any plan year for which the plan is top-heavy (90%)\nIntegrated Allocation of Employer Contributions-2 Tier, but 4 Tier applies in any plan year for which the plan is top-heavy (90.01%)\nIntegrated Allocation of Employer Contributions-2 Tier, but 4 Tier applies in any plan year for which the plan is top-heavy (80%)\nIntegrated Allocation of Employer Contributions-2 Tier, but 4 Tier applies in any plan year for which the plan is top-heavy (80.01%)\nNA\nCustom", "Please add statement narrative information for any Integrated Allocation of Employer Non-elective Contributions if they apply:": "", "Please select the Participant Restriction on Investment Direction narrative:": "Restrictions on Investement Direction\nN/A\nCustom", "Please add statement narrative information for any participant restriction on investment direction if they apply:": "", "Please add statement narrative information for any Floor Offset Arrangements if they apply:": "", "For purposes of Plan setup, are there any additional provisions that have not been captured in preceding questions?:": ""}